03-projects/03-rails-blog/app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles"

  def show
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 2 LIMIT 1

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES ('Gabe e muito linda', 'ksadjfioasdjfojasidfjoisadjfoajsdifoaifjiadjsf', '2026-06-25 19:50:35.078511', '2026-06-25 19:50:35.078511') RETURNING "id"

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = 'second - edited', "description" = 'text ? - edited', "updated_at" = '2026-06-19 11:35:07.015117' WHERE "articles"."id" = 2

  def destroy
    @article.destroy!
---
DELETE FROM "articles" WHERE "articles"."id" = 2

    def set_article
      @article = Article.find(params.expect(:id))
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 2 LIMIT 1